rayddteam/freebsd-pi/share/man/man4/uark.4
.\"	$OpenBSD: uark.4,v 1.3 2006/10/26 19:42:36 jmc Exp $
.\"
.\" Copyright (c) 2006 Jonathan Gray <jsg@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.\" $FreeBSD: projects/armv6/share/man/man4/uark.4 234858 2012-05-01 04:01:22Z gonzo $
.\"
.Dd November 20, 2011
.Dt UARK 4
.Os
.Sh NAME
.Nm uark
.Nd Arkmicro Technologies ARK3116 based USB serial adapter
.Sh SYNOPSIS
To compile this driver into the kernel,
place the following lines in your
kernel configuration file:
.Bd -ragged -offset indent
.Cd "device usb"
.Cd "device ucom"
.Cd "device uark"
.Ed
.Pp
Alternatively, to load the driver as a
module at boot time, place the following line in
.Xr loader.conf 5 :
.Bd -literal -offset indent
uark_load="YES"
.Ed
.Sh DESCRIPTION
The
.Nm
driver supports Arkmicro Technologies ARK3116 based serial adapters.
.Sh HARDWARE
The
.Nm
driver supports the following adapters:
.Pp
.Bl -bullet -compact
.It
HL USB-RS232
.It
HugePine USB-UART
.It
KQ-U8A Data Cable
.It
Skymaster USB to RS232
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr ucom 4 ,
.Xr usb 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 4.0 .
The first
.Fx
release to include it was
.Fx 7.0 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Jonathan Gray
.Aq jsg@openbsd.org .
.Sh CAVEATS
Setting hardware flow control is not currently supported.
It is not yet known how to ask the hardware to send a break.
.Pp
Arkmicro Technologies do not reply to requests of documentation
for their products.
